apps/backend/loadtests/artillery/load.yml
config:
  target: "{{ $processEnvironment.BASE_URL || 'http://localhost:3000' }}"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 50
    - duration: 180
      arrivalRate: 50
      rampTo: 100
    - duration: 60
      arrivalRate: 100
      rampTo: 0
scenarios:
  - flow:
      - get:
          url: "/api/health"
      - think: 1